# ####################################################################

#  Created by Encounter(R) RTL Compiler RC14.25 - v14.20-s046_1 on Sun May 03 02:54:09 +0530 2020

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design project_top

create_clock -name "clk" -add -period 1.5 -waveform {0.0 0.75} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.3 [get_ports {A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.3 [get_ports {A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.3 [get_ports {A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.3 [get_ports {A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.2 [get_ports {A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.2 [get_ports {A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.2 [get_ports {A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.2 [get_ports {A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {B[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.4 [get_ports {B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.4 [get_ports {B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.4 [get_ports {B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.4 [get_ports {B[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {C[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {C[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.18 [get_ports {out[0]}]
set_input_transition -min 0.1 [get_ports {A[3]}]
set_input_transition -max 0.2 [get_ports {A[3]}]
set_input_transition -min 0.1 [get_ports {A[2]}]
set_input_transition -max 0.2 [get_ports {A[2]}]
set_input_transition -min 0.1 [get_ports {A[1]}]
set_input_transition -max 0.2 [get_ports {A[1]}]
set_input_transition -min 0.1 [get_ports {A[0]}]
set_input_transition -max 0.2 [get_ports {A[0]}]
set_input_transition -min 0.3 [get_ports {B[3]}]
set_input_transition -max 0.5 [get_ports {B[3]}]
set_input_transition -min 0.3 [get_ports {B[2]}]
set_input_transition -max 0.5 [get_ports {B[2]}]
set_input_transition -min 0.3 [get_ports {B[1]}]
set_input_transition -max 0.5 [get_ports {B[1]}]
set_input_transition -min 0.3 [get_ports {B[0]}]
set_input_transition -max 0.5 [get_ports {B[0]}]
set_input_transition -min 0.1 [get_ports {C[7]}]
set_input_transition -max 0.3 [get_ports {C[7]}]
set_input_transition -min 0.1 [get_ports {C[6]}]
set_input_transition -max 0.3 [get_ports {C[6]}]
set_input_transition -min 0.1 [get_ports {C[5]}]
set_input_transition -max 0.3 [get_ports {C[5]}]
set_input_transition -min 0.1 [get_ports {C[4]}]
set_input_transition -max 0.3 [get_ports {C[4]}]
set_input_transition -min 0.1 [get_ports {C[3]}]
set_input_transition -max 0.3 [get_ports {C[3]}]
set_input_transition -min 0.1 [get_ports {C[2]}]
set_input_transition -max 0.3 [get_ports {C[2]}]
set_input_transition -min 0.1 [get_ports {C[1]}]
set_input_transition -max 0.3 [get_ports {C[1]}]
set_input_transition -min 0.1 [get_ports {C[0]}]
set_input_transition -max 0.3 [get_ports {C[0]}]
set_wire_load_mode "enclosed"
set_wire_load_model -name "WLM" -library "slow" [current_design]
set_dont_use [get_lib_cells slow/HOLDX1]
set_clock_uncertainty -setup 0.01 [get_clocks clk]
set_clock_uncertainty -hold 0.01 [get_clocks clk]
